// Создать массив из числа любой разрядности
Console.WriteLine("Введите любое число - на выходе получите массив, состоящий из цифр этого числа");
string istring = Console.ReadLine();
int num = int.Parse(istring);
int[] array = new []
